In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.set_option('display.max_colwidth', None)

In [3]:
dflenguage= pd.read_csv(r'C:\Users\flori\Desktop\DATA SCIENCE\LABS\Trabajos\Proyecto_Indiv_1_MLO_Henry\ETL\CSVNUEVOS\Language.csv')
dflenguage.head()

      id original_language
0    862                en
1   8844                en
2  15602                en
3  31357                en
4  11862                en

In [4]:
dflenguage.shape

(44936, 2)

In [5]:
lenguage_original = dflenguage['original_language'].unique().tolist()
print(lenguage_original)

['en', 'fr', 'zh', 'it', 'fa', 'nl', 'de', 'cn', 'ar', 'es', 'ru', 'sv', 'ja', 'ko', 'sr', 'bn', 'he', 'pt', 'wo', 'ro', 'hu', 'cy', 'vi', 'cs', 'da', 'no', 'nb', 'pl', 'el', 'sh', 'xx', 'mk', 'bo', 'ca', 'fi', 'th', 'sk', 'bs', 'hi', 'tr', 'is', 'ps', 'ab', 'eo', 'ka', 'mn', 'bm', 'zu', 'uk', 'af', 'la', 'et', 'ku', 'fy', 'lv', 'ta', 'sl', 'tl', 'ur', 'rw', 'id', 'bg', 'mr', 'lt', 'kk', 'ms', 'sq', nan, 'qu', 'te', 'am', 'jv', 'tg', 'ml', 'hr', 'lo', 'ay', 'kn', 'eu', 'ne', 'pa', 'ky', 'gl', 'uz', 'sm', 'mt', 'hy', 'iu', 'lb', 'si']

In [6]:
len(lenguage_original)

90

In [7]:
# Reemplazo los valores numero por Nulo
dflenguage['original_language'].replace('82.0', None, inplace=True)
dflenguage['original_language'].replace('68.0', None , inplace=True)
dflenguage['original_language'].replace('104.0', None , inplace=True)

In [8]:
# elimino Nulos
dflenguage.dropna()

           id original_language
0         862                en
1        8844                en
2       15602                en
3       31357                en
4       11862                en
...       ...               ...
44931   30840                en
44932  111109                tl
44933   67758                en
44934  227506                en
44935  461257                en

[44926 rows x 2 columns]

In [9]:
#cuento cuantos hay de cada uno y los ordeno
grouped = dflenguage[['id','original_language']].groupby('original_language').count().reset_index()
grouped.sort_values(by= 'id', ascending=False)

   original_language     id
17                en  31893
24                fr   2417
34                it   1510
36                ja   1342
15                de   1072
..               ...    ...
25                fy      1
18                eo      1
13                cy      1
4                 ay      1
88                zu      1

[89 rows x 2 columns]

In [13]:
grouped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   original_language  89 non-null     object
 1   id                 89 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.5+ KB

In [12]:
grouped['id'] = grouped['id'].astype(float)

In [ ]:
cant= grouped[grouped['id']=='en']

In [ ]:
cant

Empty DataFrame
Columns: [original_language, id]
Index: []

In [14]:
grouped.to_csv('LenguageCANTIDAD.csv', index=False)

Desanido la columna del lenguage para saber el codigo iso

In [ ]:
### no hace falta desanidarrrrr!